# ElementCategoryFilter Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementCategoryFilter Constructor
ElementCategoryFilter Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementCategoryFilter(BuiltInCategory) | Constructs a new instance of a filter to match elements by category. |
| ElementCategoryFilter(ElementId) | Constructs a new instance of a filter to match elements by category. |
| ElementCategoryFilter(BuiltInCategory, Boolean) | Constructs a new instance of a filter to match elements by category, with the option to match all elements which are not of the given category. |
| ElementCategoryFilter(ElementId, Boolean) | Constructs a new instance of a filter to match elements by category, with the option to match all elements which are of the given category. |

# See Also
ElementCategoryFilter Class
ElementCategoryFilter Members
Autodesk.Revit.DB Namespace